Tekla Open API Reference for Tekla Structures 2025
Distance.ToFractionalInchesString Method (IFormatProvider)
 Creates a string representation of the distance in inches.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ToFractionalInchesString(
	IFormatProvider formatProvider
)
Public Function ToFractionalInchesString (
	formatProvider As IFormatProvider
) As String
Parameters
formatProvider
Type: System.IFormatProvider
The number format provider.
Return Value
Type: String
The string representation of the distance.
Examples
 This example shows how to specify a format provider when converting a Distance instance into a fractional string representation of inches.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
       public void Example1()
       {
           // For this demonstration, we'll format 300.2 millimeters.
           Distance distance = new Distance(300.2);
           string formattedString = distance.ToFractionalInchesString(CultureInfo.InvariantCulture);
       }
}
See Also
Reference
Distance Structure
ToFractionalInchesString Overload
Tekla.Structures.Datatype Namespace